Autodesk.Revit.DB.Mechanical.DuctShape
Since:
2013
Enumerated type listing possible shapes for ducts.
Since:
2013

Autodesk.Revit.DB.Mechanical.DuctShape.Oval
Oval duct shape.

Autodesk.Revit.DB.Mechanical.DuctShape.Rectangular
Rectangular duct shape.

Autodesk.Revit.DB.Mechanical.DuctShape.Round
Round duct shape.